Revit 2027 API
RebarConstraint.GetCustomHandleTag Method
 Returns the handle tag of the RebarConstrainedHandle. This is valid only for Free Form Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetCustomHandleTag()
Public Function GetCustomHandleTag As Integer
public:
int GetCustomHandleTag()
member GetCustomHandleTag : unit -> int
Return Value
Int32
 Returns the handle tag of the RebarConstrainedHandle.
Exceptions
Exception | Condition
InvalidOperationException |  Constrained rebar isn't a Free Form Rebar element.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace